In [2]:
import numpy as np 
import pandas as pd

## GroupBy

In [51]:
data = {
    'Category': ['A', 'B', 'A', 'B', 'A', 'B', 'A', 'B'],
    'Store': ['S1', 'S1', 'S2', 'S2', 'S1', 'S2', 'S2', 'S1'],
    'Sales': [100, 200, 150, 250, 120, 180, 200, 300],
    'Quantity': [10, 15, 12, 18, 8, 20, 15, 25],
    'Date': pd.date_range('2023-01-01', periods=8)
}

df = pd.DataFrame(data)

In [49]:
df

  Category Store  Sales  Quantity       Date
0        B    S1    100        10 2023-01-01
1        B    S1    200        15 2023-01-02
2        A    S2    150        12 2023-01-03
3        B    S2    250        18 2023-01-04
4        A    S1    120         8 2023-01-05
5        B    S2    180        20 2023-01-06
6        A    S2    200        15 2023-01-07
7        B    S1    300        25 2023-01-08

In [ ]:
# GroupBy "Category" and calculate the sum of the Sales

In [22]:
df.groupby("Category")["Sales"].sum()

Category
A    570
B    930
Name: Sales, dtype: int64

In [ ]:
# GroupBy "Stores" and calculate the sum of the sales

In [24]:
df.groupby('Store')['Sales'].sum()

Store
S1    720
S2    780
Name: Sales, dtype: int64

In [ ]:
# groupBy multiple columns
# GroupBy category and stores

In [30]:
df.groupby(["Category","Store"])[['Sales','Quantity']].sum()

                Sales  Quantity
Category Store
A        S1       220        18
         S2       350        27
B        S1       500        40
         S2       430        38

## Aggregation

In [44]:
print(df['Sales'].mean())
print(df['Sales'].sum())
print(df['Sales'].min())
print(df['Sales'].max())
print(df['Sales'].count())

187.5
1500
100
300
8

In [36]:
df

  Category Store  Sales  Quantity       Date
0        A    S1    100        10 2023-01-01
1        B    S1    200        15 2023-01-02
2        A    S2    150        12 2023-01-03
3        B    S2    250        18 2023-01-04
4        A    S1    120         8 2023-01-05
5        B    S2    180        20 2023-01-06
6        A    S2    200        15 2023-01-07
7        B    S1    300        25 2023-01-08

In [46]:
df["Sales"].agg(["sum","count","min","max","mean",lambda x: x.mode()[0]])

sum         1500.0
count          8.0
min          100.0
max          300.0
mean         187.5
<lambda>     200.0
Name: Sales, dtype: float64

In [52]:
df['Category'].agg([lambda x: x.mode()[0]])

<lambda>    A
Name: Category, dtype: object